results/shelf-1000-1k-n10.1.log

Summary:
  Total:	0.0588 secs
  Slowest:	0.0571 secs
  Fastest:	0.0127 secs
  Average:	0.0442 secs
  Requests/sec:	16997.3839
  
  Total data:	1102 bytes
  Size/request:	2 bytes

Response time histogram:
  0.013 [1]	|
  0.017 [0]	|
  0.022 [5]	|■
  0.026 [6]	|■
  0.030 [18]	|■■■
  0.035 [33]	|■■■■■
  0.039 [43]	|■■■■■■■
  0.044 [81]	|■■■■■■■■■■■■■
  0.048 [257]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.053 [74]	|■■■■■■■■■■■■
  0.057 [33]	|■■■■■


Latency distribution:
  10% in 0.0347 secs
  25% in 0.0409 secs
  50% in 0.0455 secs
  75% in 0.0477 secs
  90% in 0.0522 secs
  95% in 0.0531 secs
  99% in 0.0564 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0043 secs, 0.0127 secs, 0.0571 secs
  DNS-lookup:	0.0094 secs, 0.0000 secs, 0.0213 secs
  req write:	0.0004 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0126 secs, 0.0032 secs, 0.0265 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [200]	551 responses

Error distribution:
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55289->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55290->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55291->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55292->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55293->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55294->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55295->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55296->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55297->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55298->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55299->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55300->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55301->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55302->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55303->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55304->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55305->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55306->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55307->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55308->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55309->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55310->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55311->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55312->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55313->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55314->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55315->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55316->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55317->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55318->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55319->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55320->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55321->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55323->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55324->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55325->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55326->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55328->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55329->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55331->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55333->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55334->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55336->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55337->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55339->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55340->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55341->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55342->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55344->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55345->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55346->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55349->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55350->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55351->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55353->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55354->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55355->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55356->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55358->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55361->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55362->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55363->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55365->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55368->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55370->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55371->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55372->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55374->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55375->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55376->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55377->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55378->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55379->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55380->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55382->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55383->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55384->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55385->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55386->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55387->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55388->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55389->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55390->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55391->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55392->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55393->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55395->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55396->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55397->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55399->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55400->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55401->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55402->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55403->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55404->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55405->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55406->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55407->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55408->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55409->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55410->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55411->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55412->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55413->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55414->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55416->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55417->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55418->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55419->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55420->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55421->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55422->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55424->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55425->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55426->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55429->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55430->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55431->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55432->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55433->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55435->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55437->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55438->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55439->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55440->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55441->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55442->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55443->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55444->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55445->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55446->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55447->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55448->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55451->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55452->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55453->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55454->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55455->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55456->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55458->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55459->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55460->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55461->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55462->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55463->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55464->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55465->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55466->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55467->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55468->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55469->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55470->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55471->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55473->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55474->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55475->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55476->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55477->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55479->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55480->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55482->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55483->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55484->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55485->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55486->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55487->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55489->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55490->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55491->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55492->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55493->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55494->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55495->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55496->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55497->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55498->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55499->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55500->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55501->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55502->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55503->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55504->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55505->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55506->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55507->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55509->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55510->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55512->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55513->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55514->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55515->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55516->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55518->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55519->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55520->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55521->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55522->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55523->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55524->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55525->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55526->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55527->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55528->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55529->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55530->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55531->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55532->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55533->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55534->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55535->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55536->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55537->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55538->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55539->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55540->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55541->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55542->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55543->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55544->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55545->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55546->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55547->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55548->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55549->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55550->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55551->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55552->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55553->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55554->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55556->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55558->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55560->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55561->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55562->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55563->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55564->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55565->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55566->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55567->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55568->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55569->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55570->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55571->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55572->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55573->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55574->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55575->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55576->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55577->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55578->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55579->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55580->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55582->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55583->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55584->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55585->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55586->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55587->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55588->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55589->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55590->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55591->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55592->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55593->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55594->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55595->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55596->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55597->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55598->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55599->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55600->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55601->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55602->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55603->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55605->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55606->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55607->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55608->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55609->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55610->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55611->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55612->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55613->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55614->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55615->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55616->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55617->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55619->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55620->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55621->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55622->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55623->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55624->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55626->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55627->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55628->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55629->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55630->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55632->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55633->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55634->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55635->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55637->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55638->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55639->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55640->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55642->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55643->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55644->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55646->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55647->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55649->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55650->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55651->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55652->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55653->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55654->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55655->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55656->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55657->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55658->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55659->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55660->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55662->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55664->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55665->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55666->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55667->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55668->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55669->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55670->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55671->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55672->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55674->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55675->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55676->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55677->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55678->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55680->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55682->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55684->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55685->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55686->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55688->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55689->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55691->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55693->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55695->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55696->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55697->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55698->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55699->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55700->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55701->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55702->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55703->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55706->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55707->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55708->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55710->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55711->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55714->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55715->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55716->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55717->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55718->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55719->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55721->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55722->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55723->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55725->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55726->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55727->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55729->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55730->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55732->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55733->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55734->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55736->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55737->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55738->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55740->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55743->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55745->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55747->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55750->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55752->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55753->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55754->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55755->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55756->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55757->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55758->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55762->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55763->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55765->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55767->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55769->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55770->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55775->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55776->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55777->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55780->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55781->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55782->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55783->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55784->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55786->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55788->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55789->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55790->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55791->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55792->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55794->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55797->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55798->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55799->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55802->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55803->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55804->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55806->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55807->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55808->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55809->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55810->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55814->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55815->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55816->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55817->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55821->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55824->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55827->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55830->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55835->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55836->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55843->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55856->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55862->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55867->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55868->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55874->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55875->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55882->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55884->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55885->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55891->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55892->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55901->[::1]:8080: read: connection reset by peer
  [1]	Get "http://localhost:8080/health": read tcp [::1]:55919->[::1]:8080: read: connection reset by peer